app/controllers/attorneys_controller.rb

  def index
    @attorneys = Attorney.all
---
SELECT * FROM `attorneys`

  def attorneys_list
    @attorneys = Attorney.all
---
SELECT * FROM `attorneys`

  def show
    @attorney = Attorney.find_by_short_name(params[:id])
---
SELECT * FROM `attorneys` WHERE (`attorneys`.`short_name` = 'barrykozyra') LIMIT 1

  def edit

    @attorney = Attorney.find_by_short_name(params[:id])
---
SELECT * FROM `attorneys` WHERE (`attorneys`.`short_name` = 'barrykozyra') LIMIT 1

  def create

    unless params[:attorney][:photo].nil? or params[:attorney][:photo] == ""
      params[:attorney][:photo_present] = true
    end

    @attorney = Attorney.new(params[:attorney])
    @attorney.short_name = @attorney.name.gsub(' ', '_').gsub(',', '').gsub('.', '').downcase

    respond_to do |format|
      if @attorney.save
---
INSERT INTO `attorneys` (`name`, `created_at`, `photo_file_size`, `thumbnail_id`, `updated_at`, `photo_file_name`, `role`, `photo_content_type`, `photo_updated_at`, `short_name`, `biography`, `email`) VALUES('Raj Gadhok', '2010-01-03 06:39:03', 173247, NULL, '2010-01-03 06:39:03', 'IMG_3604.JPG', 'Member', 'image/jpeg', '2010-01-03 06:39:03', 'rajgadhok', 'adf;k;s', 'rajgadhok@kozyrahartz.com')

  def update
    @attorney = Attorney.find_by_short_name(params[:id])
    @attorney.short_name = @attorney.name.gsub(' ', '_').gsub(',', '').gsub('.', '').downcase

    respond_to do |format|
      if @attorney.update_attributes(params[:attorney])
---
SELECT * FROM `attorneys` WHERE (`attorneys`.`short_name` = 'judithhartz') LIMIT 1
UPDATE `attorneys` SET `updated_at` = '2009-10-13 05:46:18', `biography` = 'Mr. Kozyra is a graduate of the University of Chicago (B.A. with Honors in The College and in American History, 1975) and Rutgers Law School - Newark (J.D., 1978).&nbsp; He is admitted to the bars in New Jersey and New York, the Second, Third and Ninth Circuit Courts of Appeals, and in the United States Supreme Court, and has handled federal and state litigation at both the trial and appellate levels.' WHERE `id` = 1

  def destroy
    @attorney = Attorney.find_by_short_name(params[:id])
    @attorney.destroy
---
SELECT * FROM `attorneys` WHERE (`attorneys`.`short_name` = 'judithhartz') LIMIT 1
DELETE FROM `attorneys` WHERE `id` = 2