app/controllers/directory_controller.rb

  def catcher

    if params[:path].last == "attorneys.htm"
      redirect_to attorneys_url
    elsif params[:path].last == "recent_news.htm"
      redirect_to news_entries_url
    elsif params[:path].last == "contact.htm"
      redirect_to contact_url
    elsif params[:path].last == "jahartz.html"
      @attorney = Attorney.find_by_short_name("judith_a_hartz")
---
SELECT * FROM `attorneys` WHERE (`attorneys`.`short_name` = 'judith_a_hartz') LIMIT 1