app/controllers/firms_controller.rb

  def index
    @firms = Firm.all
    @overview = Firm.find_by_url("overview")
---
SELECT * FROM `firms`
SELECT * FROM `firms` WHERE (`firms`.`url` = 'overview') LIMIT 1

  def create
    @firm = Firm.new(params[:firm])
    @firm.url = @firm.title.downcase.gsub(' ','_')

    respond_to do |format|
      if @firm.save
---
INSERT INTO `firms` (`created_at`, `title`, `updated_at`, `url`, `information`) VALUES('2010-01-08 21:41:48', 'Overview', '2010-01-08 21:41:48', 'overview', '')

  def firm_list
    @firms = Firm.all
---
SELECT * FROM `firms`