app/controllers/news_entries_controller.rb

SELECT * FROM `news_entries` ORDER BY date DESC LIMIT 0, 5
---
  def index
    @news_entries = NewsEntry.paginate(:per_page => 5, :page => params[:page], :order => "date DESC")