app/controllers/news_entries_controller.rb

SELECT * FROM `news_entries`
---
  def news_list
    @news_entries = NewsEntry.all