app/controllers/practice_areas_controller.rb

  def index
    @practice_areas = PracticeArea.all
---
SELECT * FROM `practice_areas`