app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `email`) VALUES('Jillian Kozyra', '200992600.464848654188673', '2009-10-14 03:13:59', '2009-10-14 03:13:59', 'ab0316eb6c937c629b43e4e305f2b97fe29584f6', 'Jillyh0@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-10-14 01:40:25', `salt` = '127177700.191669474515009', `email` = 'Jillyh0@gmail.com', `hashed_password` = '8cd6949e6364e80f67efe97042cc18457151db87' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
DELETE FROM `users` WHERE `id` = 2
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy